app/controllers/trails_controller.rb

SELECT  "trails".* FROM "trails"  ORDER BY "trails"."id" ASC LIMIT 1
---
  def index
    @trails = Trail.all